Revit 2024 API
ExternalResourceReference.ServerId Property
 The id of the server that Revit is expecting to provide the external resource.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2015
Syntax
C#
public Guid ServerId { get; }
Visual Basic
Public ReadOnly Property ServerId As Guid
	Get
Visual C++
public:
property Guid ServerId {
	Guid get ();
}
See Also
ExternalResourceReference Class
Autodesk.Revit.DB Namespace